n3tk0/ESP32_Logger/node/src/main.cpp
// ============================================================================
// ESP32_Logger sensor node — ESP8266 satellite
//
// Reads the sensors its config lists and POSTs the values to an ESP32_Logger
// collector's /api/ingest. The config itself is docs/NODE_CONFIG.md §1: set
// on the node's own page (ConfigPortal.cpp), or by the collector in the reply
// to a POST (§3), which is also how the node follows the collector to a new
// network (§4) and finds it again when its address changes (§3.1).
//
// No storage beyond the config, no display, and — outside the setup page —
// no listening port except the background page on the LAN, and that only
// behind basic auth.
//
// Everything sensor-specific lives in node_common/NodeSensors.cpp (shared with
// the ESP-NOW node); every decision about the config and the link that can be
// made without a board lives in NodeSync.h, where tests/host reaches it.
//
// See README.md in this directory for wiring and setup.
// ============================================================================
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>
#include <WiFiUdp.h>
#include <ArduinoJson.h>
#include <new>

#include "node_config.h"
#include "NodeLog.h"
#include "NodeStore.h"
#include "NodeSync.h"
#include "ConfigPortal.h"
#include "Backlog.h"
#include "FwOffer.h"
#include "FwFlash.h"
#include "node_common/NodeSensors.h"
#include "src/nodecfg/NodeConfigJson.h"
#include "NodeCfgTables.h"
#include "src/nodecfg/UdpDiscovery.h"
#include "src/nodecfg/UdpDiscoveryHmac.h"
#include "src/nodecfg/FwImage.h"

using nodecfg::NodeConfig;
using NodeSync::Net;

static NodeConfig        s_cfg;
static SyncState         s_sync;
static NodeSync::Link    s_link;
static PortalLinkStatus  s_linkStatus;

static uint32_t s_lastPost   = 0;
static bool     s_postedOnce = false;

/// How many configured sensor entries answered at the last nodeSensorsBegin(),
/// and the cycles since. One that failed at boot while another works is
/// retried every SENSOR_RETRY_CYCLES cycles, not only once all are down.
static const uint8_t SENSOR_RETRY_CYCLES = 5;
static int      s_sensorsOk    = 0;
static uint8_t  s_sensorCycles = 0;

static bool     s_portalBgRunning = false;

/// §3: the full config goes with the first POST after boot (until one
/// carrying it is answered), and with every POST while `local`.
static bool     s_reportedSinceBoot = false;
/// The rev this node last refused — or rolled back. Never re-applied; see
/// NodeSync::decideReply().
static uint16_t s_rejectedRev = 0;
/// A config from the collector changed the network, the I2C pair or the
/// sensors: restart once this cycle's POSTs are done.
static bool     s_restartPending = false;
/// The network settings this boot has been posting with, pinned when a
/// collector config that restarts the node replaces s_cfg mid-cycle. The
/// reply that carried it came over THIS association to THIS host with THIS
/// token; the new settings take effect at the restart (WiFi is only joined at
/// boot), so the batches still to go before it — restartForConfig() hands over
/// the RAM backlog — go where the last one just went. nullptr otherwise; on
/// the heap because it lives only until the restart.
static nodecfg::NetCfg* s_postNet = nullptr;

// ---------------------------------------------------------------------------
// Firmware identity (docs/NODE_OTA.md §1)
// ---------------------------------------------------------------------------

/// The marker that makes this .bin a node image of kind "esp8266" (§1.1): the
/// collector refuses an upload without it, and this node refuses an image
/// without it. In flash (PROGMEM), and PRINTED at boot — an array nothing
/// references is dropped by --gc-sections, marker and all, and the build
/// would still succeed.
static const char FW_MARKER[] PROGMEM = NODEFW_MARKER_TEXT("esp8266", NODE_FW_VERSION);

/// ESP.getSketchMD5() — the MD5 of exactly the .bin this node was flashed
/// from (§1.3), which is how the collector knows an update is RUNNING and not
/// merely downloaded (§0.5). Hashing the ~460 KB sketch out of flash takes a
/// few hundred milliseconds, so once, at boot; "" if it could not be read,
/// and then the POST says nothing rather than something wrong.
static char s_fwMd5[NodeFw::MD5_CAP] = "";

/// The `fw` of the latest answered ingest reply — acted on once the cycle's
/// POSTs are done (§3), and forgotten either way.
static NodeFw::Offer  s_fwOffer;
/// What failed since boot, and the fw_error still to deliver.
static NodeFw::Report s_fwReport;

// ---------------------------------------------------------------------------
// Collector discovery (§3.1)
// ---------------------------------------------------------------------------

/// Broadcast the signed query and adopt whoever answers with a valid reply.
///
/// WHEN: right after this node moved to the collector's next network (§4.5),
/// and after three failed POSTs in a row. Both are "the address this node
/// has for the collector may be wrong"; nothing else is a reason to believe
/// a broadcast over the address the user typed.
///
/// The reply is tagged with the ingest token, so this adopts only a device
/// holding the same token — not whatever on the LAN answers first. The local
/// socket is bound to the discovery port itself, so a collector that replies
/// to the port rather than to the query's source port still reaches it.
static bool runDiscovery() {
    using namespace nodecfg::udpdisc;
    if (WiFi.status() != WL_CONNECTED) return false;

    uint8_t nonce[NONCE_LEN];
    ESP.random(nonce, sizeof(nonce));
    uint8_t query[QUERY_LEN];
    if (!buildQuery(query, nonce, s_cfg.name, s_cfg.net.token, udpdiscHmacSha256)) {
        LOGLN("[disc] cannot build a query (node name?)");
        return false;
    }

    WiFiUDP udp;
    if (!udp.begin(DISCOVERY_PORT)) {
        LOGLN("[disc] cannot open the UDP socket");
        return false;
    }

    bool found = false;
    IPAddress from;
    uint16_t port = 0;
    // Three tries, 700 ms each: a collector busy writing a log file answers
    // late, and a lost broadcast on a busy 2.4 GHz band is common.
    for (int attempt = 0; attempt < 3 && !found; attempt++) {
        // The subnet's broadcast AND the limited broadcast: some access points
        // drop one or the other between wireless clients.
        const IPAddress dests[2] = { WiFi.broadcastIP(), IPAddress(255, 255, 255, 255) };
        for (const IPAddress& d : dests) {
            udp.beginPacket(d, DISCOVERY_PORT);
            udp.write(query, sizeof(query));
            udp.endPacket();
        }
        const uint32_t t0 = millis();
        while (!found && millis() - t0 < 700) {
            const int len = udp.parsePacket();
            if (len <= 0) { delay(10); continue; }
            uint8_t buf[REPLY_LEN + 1];
            const int n = udp.read(buf, sizeof(buf));
            uint16_t p = 0;
            // The reply must come from the address it signed (§3.1): a host
            // re-sending a captured reply from its own IP is refused here.
            const IPAddress rip = udp.remoteIP();
            const uint8_t ripb[4] = { rip[0], rip[1], rip[2], rip[3] };
            if (n > 0 && parseReply(buf, (size_t)n, nonce, s_cfg.net.token,
                                    udpdiscHmacSha256, ripb, p)) {
                from  = rip;
                port  = p;
                found = true;
            }
        }
    }
    udp.stop();

