n3tk0/ESP32_Logger/node/src/main.cpp
    if (!found) {
        LOGLN("[disc] no collector answered");
        return false;
    }

    char host[nodecfg::HOST_CAP];
    nodecfg::copyStr(host, sizeof(host), from.toString().c_str());
    if (strcmp(host, s_cfg.net.host) == 0 && port == s_cfg.net.port) {
        LOGF("[disc] collector confirmed at %s:%u\n", host, (unsigned)port);
        return true;
    }
    LOGF("[disc] collector found at %s:%u (was %s:%u)\n", host, (unsigned)port,
                  s_cfg.net.host, (unsigned)s_cfg.net.port);
    nodecfg::copyStr(s_cfg.net.host, sizeof(s_cfg.net.host), host);
    s_cfg.net.port = port;
    // §3.1: saved and marked local, so the collector learns the address it
    // has on this network from the next report.
    s_cfg.local = true;
    storeSave(s_cfg, !s_link.onTrial());
    return true;
}

// ---------------------------------------------------------------------------
// WiFi
// ---------------------------------------------------------------------------

static bool connectTo(const char* ssid, const char* pass) {
    WiFi.mode(WIFI_STA);
    WiFi.persistent(false);
    for (int attempt = 1; attempt <= 3; attempt++) {
        LOGF("[wifi] connecting to \"%s\" (attempt %d/3)", ssid, attempt);
        WiFi.begin(ssid, pass);

        const uint32_t start = millis();
        while (WiFi.status() != WL_CONNECTED) {
            if (millis() - start > WIFI_CONNECT_TIMEOUT_MS) {
                LOGLN(" timed out");
                break;
            }
            delay(250);
            Serial.print('.');
            yield();
        }
        if (WiFi.status() == WL_CONNECTED) {
            LOGF(" ok, %s\n", WiFi.localIP().toString().c_str());
            return true;
        }
        // Clean up before the next attempt.
        WiFi.disconnect();
        delay(1000);
    }
    WiFi.disconnect(true);
    return false;
}

/// Bring WiFi up: three attempts on this cycle's network — the configured
/// one, or the collector's next one once the configured one has failed two
/// cycles running (§4.5) — then the setup portal for PORTAL_TIMEOUT_MS.
static bool ensureWifi() {
    if (WiFi.status() == WL_CONNECTED) {
        // Only flag it as running if it actually started: portalStartBackground()
        // refuses without basic-auth credentials, and setting the flag anyway
        // would have loop() calling portalHandleClient() on a server that was
        // never begun.
        if (!s_portalBgRunning) s_portalBgRunning = portalStartBackground(s_cfg);
        return true;
    }

    const bool hasNext = s_cfg.net.next.ssid[0] != '\0';
    const Net  which   = s_link.networkToTry(hasNext);
    const bool next    = (which == Net::Next);
    if (next) LOGF("[wifi] \"%s\" failed %u cycles; trying the next network\n",
                            s_cfg.net.ssid, (unsigned)s_link.wifiFails());

    if (connectTo(next ? s_cfg.net.next.ssid : s_cfg.net.ssid,
                  next ? s_cfg.net.next.pass : s_cfg.net.pass)) {
        const uint8_t a = s_link.wifiResult(true, which);
        if (a & NodeSync::LA_PROMOTE) {
            // §4.5: the new network is now this node's network; the old one is
            // kept as next, so a cancelled switch is survivable.
            NodeSync::promoteNext(s_cfg);
            storeSave(s_cfg, !s_link.onTrial());
            LOGF("[wifi] moved to \"%s\" (\"%s\" kept as next)\n",
                          s_cfg.net.ssid, s_cfg.net.next.ssid);
        }
        if (a & NodeSync::LA_DISCOVER) runDiscovery();
        if (!s_portalBgRunning) s_portalBgRunning = portalStartBackground(s_cfg);
        return true;
    }
    s_link.wifiResult(false, which);

    LOGLN("[wifi] repeated failures — opening setup portal");
    s_portalBgRunning = false; // portalRun will stop the HTTP server on exit
    if (portalRun(s_cfg, PORTAL_TIMEOUT_MS)) {
        LOGLN("[cfg] saved, restarting");
        delay(200);
        ESP.restart();
    }
    // Portal timed out. Return false so the loop can carry on recording.
    return false;
}

// ---------------------------------------------------------------------------
// The backlog
// ---------------------------------------------------------------------------
//
// WHY A NODE THAT CANNOT REACH THE COLLECTOR KEEPS ITS READINGS
//
// It used to read its sensor, fail to POST, print a line and throw the values
// away. A router reboot at 2 am was therefore a hole in the record that
// nothing could fill afterwards: the measurements had existed, briefly, in a
// stack frame. The collector has had a queue for exactly this since the
// ESP-NOW path was written (RemoteIngest::putHistorical) — the HTTP node just
// had nothing to hand it.
//
// A FLAT RING OF READINGS, NOT OF SAMPLES. Grouping by moment would mean
// sizing every slot for NODE_MAX_READINGS whether a node reports three metrics
// or eight, and paying for the eight on the node that reports three. The
// collector treats each reading independently anyway — each one carries its
// own age — so there is nothing for the grouping to buy.
//
// Each entry remembers millis() rather than a date. This node has no clock:
// what it can always say honestly is how long ago, which is what `dt_s` on the
// wire means and what the collector turns back into a timestamp using its own
// NTP-set clock. The same field, meaning the same thing, as EnvSample::dt_s in
// the ESP-NOW protocol.
//
// The ring itself lives in Backlog.h, where a host test can reach it: the
// arithmetic that wraps an index, drops the right end and survives the
// millis() rollover is exactly the part that is wrong quietly. It holds a
// pointer to each metric name; the names live in s_names for the life of the
// process (NodeSync::NameTable says why).

// How many go in one POST. The collector's body cap is 4 KB and a reading is
// roughly sixty bytes of JSON, so this leaves room for long metric names, the
// envelope and the config report rather than discovering the ceiling as a 413.
static constexpr int NODE_BATCH_READINGS = 48;

// The largest body this node will send. Deliberately below the collector's own
// 4096-byte cap rather than equal to it: the two numbers live in different
// firmwares that are not upgraded together, and the margin is what lets an
// older collector keep taking batches from a newer node.
static constexpr size_t NODE_MAX_BODY = 3800;

