n3tk0/ESP32_Logger/node/src/main.cpp
// How many batches one cycle may send. A node coming back from an outage
// should catch up faster than it accumulates, but not turn a reconnection into
// a burst that the collector's rate limiter reads as a flood.
static constexpr int NODE_BATCHES_PER_CYCLE = 4;

static NodeBacklog::Ring   s_backlog;
static NodeSync::NameTable s_names;

// ---------------------------------------------------------------------------
// The config the collector sends (§3)
// ---------------------------------------------------------------------------

static void rejectConfig(uint16_t rev, const char* field, const char* reason) {
    LOGF("[cfg] refused rev %u: %s: %s\n", (unsigned)rev, field, reason);
    s_rejectedRev = rev;
    s_sync.err.set(rev, field, reason);
    syncSave(s_sync);
}

/// What applying a collector config needs besides the running one: the
/// candidate and the validator's answer, ~1.5 KB, on the heap for the length
/// of the call rather than on the 4 KB loop stack.
struct ApplyWork {
    NodeConfig          cfg;
    nodecfg::Validation v;
    nodecfg::Issue      issue;
};

/// validate → back up → save → apply live, or restart when the network, the
/// I2C pair or the sensor list changed.
static void applyCollectorConfig(JsonVariantConst doc, uint16_t rev) {
    ApplyWork* w = new (std::nothrow) ApplyWork();
    if (!w) {
        LOGLN("[cfg] out of memory for the collector's config; next cycle");
        return;
    }
    w->cfg = s_cfg;
    // NCJ_DEC_REV: this config says which rev it is. Secrets arrive in full
    // here (the one place they travel, §0.5); "" still means keep.
    if (!nodecfg::decodeConfig(doc, w->cfg, nodecfg::NCJ_DEC_REV, &w->issue)) {
        rejectConfig(rev, w->issue.field, w->issue.reason);
        delete w;
        return;
    }
    w->cfg.rev   = rev;
    w->cfg.local = false;   // the collector's config, not an edit on this node

    nodeValidate(w->cfg, w->v);
    if (!w->v.ok) {
        rejectConfig(rev, w->v.error.field, w->v.error.reason);
        delete w;
        return;
    }

    const uint8_t change = NodeSync::classifyChange(s_cfg, w->cfg);
    const uint16_t prevTrial = s_sync.trialRev;
    if (change & NodeSync::CH_NET_TRIAL) {
        // §4.7: this config decides whether the node can reach anything. Run
        // it on trial; the backup storeSave() takes below is what a rollback
        // restores. The trial is written FIRST: a crash between the two
        // writes then leaves a trial naming a rev the saved config is not,
        // which setup() drops — never a new network config with no way back.
        s_sync.trialRev = rev;
        if (!syncSave(s_sync)) {
            s_sync.trialRev = prevTrial;
            LOGLN("[cfg] could not record the trial; not applying the collector's config");
            delete w;
            return;
        }
    }
    if (!storeSave(w->cfg, !s_link.onTrial())) {
        // Not refused — the config is fine, the flash is not. Nothing is
        // reported, so the collector keeps offering it and the next cycle
        // tries again.
        LOGLN("[cfg] could not save the collector's config");
        if (s_sync.trialRev != prevTrial) {
            s_sync.trialRev = prevTrial;
            syncSave(s_sync);
        }
        delete w;
        return;
    }
    // Out of memory leaves it null: the rest of the cycle then posts with the
    // new settings, which is no worse than not pinning at all.
    if ((change & NodeSync::CH_RESTART) && !s_postNet)
        s_postNet = new (std::nothrow) nodecfg::NetCfg(s_cfg.net);
    s_cfg = w->cfg;
    delete w;

    LOGF("[cfg] applied rev %u from the collector%s\n", (unsigned)rev,
                  (change & NodeSync::CH_RESTART) ? "; restarting after this cycle" : "");
    if (change & NodeSync::CH_RESTART) s_restartPending = true;
    // Everything else (name, interval, altitude, board, net.next) is read
    // from s_cfg where it is used, so it is already live.
}

static void handleReplyCfg(JsonVariantConst c) {
    NodeSync::ReplyCfg r;
    r.present = c.is<JsonObjectConst>();
    if (r.present) {
        JsonObjectConst o = c.as<JsonObjectConst>();
        r.rev = o["rev"] | 0;
        bool other = false;
        for (JsonPairConst kv : o) {
            if (strcmp(kv.key().c_str(), "rev") != 0 &&
                strcmp(kv.key().c_str(), "local") != 0) { other = true; break; }
        }
        r.revOnly = !other;
    }

    switch (NodeSync::decideReply(r, s_cfg.rev, s_cfg.local, s_rejectedRev)) {
        case NodeSync::ReplyAction::Confirm:
            // §3: "your local config is now rev N". Same content, so no backup:
            // /config.prev.json keeps the config from before the last change.
            LOGF("[cfg] collector adopted the local config as rev %u\n",
                          (unsigned)r.rev);
            s_cfg.rev   = r.rev;
            s_cfg.local = false;
            storeSave(s_cfg, false);
            break;
        case NodeSync::ReplyAction::Apply:
            applyCollectorConfig(c, r.rev);
            break;
        case NodeSync::ReplyAction::Ignore:
        case NodeSync::ReplyAction::None:
            break;
    }
}

/// The reply's `fw` (NODE_OTA.md §3), copied as it came: decideOffer() does
/// the checking, after the cycle's POSTs. The latest answered reply wins —
/// one without `fw` withdraws an offer an earlier batch carried (the user
/// cancelled between two POSTs).
static void readReplyFw(JsonVariantConst v) {
    s_fwOffer = NodeFw::Offer();
    if (!v.is<JsonObjectConst>()) return;
    s_fwOffer.present = true;
    // A truncated md5 or path is a wrong one, not a shorter right one: an
    // md5 of 33 characters cut to 32 would pass isMd5Hex(). Emptied, it is
    // refused as bad_offer.
    if (!nodecfg::copyStr(s_fwOffer.md5, sizeof(s_fwOffer.md5), v["md5"] | ""))
        s_fwOffer.md5[0] = '\0';
    if (!nodecfg::copyStr(s_fwOffer.path, sizeof(s_fwOffer.path), v["path"] | ""))
        s_fwOffer.path[0] = '\0';
    nodecfg::copyStr(s_fwOffer.ver, sizeof(s_fwOffer.ver), v["ver"] | "");
    s_fwOffer.size    = v["size"] | 0u;
    s_fwOffer.attempt = v["attempt"] | 0u;
}

// ---------------------------------------------------------------------------
// Post
// ---------------------------------------------------------------------------

enum class PostResult : uint8_t {
    Delivered,   ///< 200, and the collector took the whole batch
    Held,        ///< 200, but it took less than all of it: its queue is full
    Failed,      ///< no answer, or not a 200
};

