n3tk0/ESP32_Logger/node/src/main.cpp
/// Send up to NODE_BATCH_READINGS from the front of the backlog — or, with
/// nothing queued, none: a POST with an empty `readings` still reports the
/// config and still collects the reply's, so a node whose every sensor is
/// missing can be fixed from the collector.
///
/// Delivered only when the collector took the WHOLE batch — which is not the
/// same as "the POST returned 200", and the difference is the point. The
/// collector answers with how many readings from the front of the batch it
/// consumed; whatever it had no room for is still here and is offered again
/// next cycle. Dropping the batch on the strength of the status line is how an
/// outage at the collector becomes a hole in the record on the node.
static PostResult postBatch() {
    const int want = (s_backlog.count() < NODE_BATCH_READINGS) ? s_backlog.count()
                                                               : NODE_BATCH_READINGS;
    const uint32_t nowMs = millis();

    const bool withCfg = NodeSync::shouldSendCfg(s_cfg.local, s_reportedSinceBoot);
    const uint16_t errRev = s_sync.err.rev;
    const uint16_t fwTok  = s_fwReport.token();

    String body;
    int n = 0;
    {
        JsonDocument doc;
        doc["node"] = (const char*)s_cfg.name;
        // Still 0: this node has no clock, so the collector stamps the batch
        // with its own and subtracts each reading's age from it.
        doc["ts"] = 0;

        // §3. cfg_rev always; the config itself without secrets; a refusal
        // until it has been delivered once.
        doc["cfg_rev"] = s_cfg.rev;
        if (withCfg) nodecfg::encodeConfig(s_cfg, doc["cfg"].to<JsonObject>(), 0);
        if (s_sync.err.pending()) {
            JsonObject e = doc["cfg_error"].to<JsonObject>();
            e["rev"]    = s_sync.err.rev;
            e["field"]  = (const char*)s_sync.err.field;
            e["reason"] = (const char*)s_sync.err.reason;
        }
        // NODE_OTA.md §3: what this node runs, with every POST — the only
        // thing that makes a target `done` — and a failed update until one
        // POST carrying it has been answered.
        if (s_fwMd5[0]) doc["fw_md5"] = (const char*)s_fwMd5;
        if (fwTok) {
            JsonObject f = doc["fw_error"].to<JsonObject>();
            f["md5"]     = s_fwReport.md5();
            f["attempt"] = s_fwReport.attempt();
            f["reason"]  = s_fwReport.reason();
        }

        JsonArray readings = doc["readings"].to<JsonArray>();
        for (int i = 0; i < want; i++) {
            const NodeBacklog::Entry& p = s_backlog.at(i);
            JsonObject o = readings.add<JsonObject>();
            o["metric"] = p.metric;
            o["value"]  = p.value;
            o["unit"]   = p.unit;
            const uint32_t age = NodeBacklog::ageSeconds(nowMs, p.ms);
            if (age > 0) o["dt_s"] = age;
        }

        // TRIMMED TO FIT, BECAUSE A 413 HERE WOULD DEADLOCK THE QUEUE.
        //
        // The collector refuses a body over INGEST_MAX_BODY (4 KB) with a 413,
        // and 413 holds the batch — correctly, since a refused POST must not
        // cost readings. But a batch that is too big is refused again next
        // cycle and every cycle after: the queue never empties, and the node
        // quietly stops recording anything new the moment it fills. Forty-
        // eight readings reach ~3.6 KB only with the longest names, and the
        // config report adds up to ~1 KB on the first POST after boot — so
        // this loop does run then, and costs that one POST a few readings,
        // which the next one carries.
        while (readings.size() > 1 && measureJson(doc) > NODE_MAX_BODY) {
            readings.remove(readings.size() - 1);
        }
        n = (int)readings.size();
        if (doc.overflowed()) {
            LOGLN("[post] out of memory building the batch");
            return PostResult::Failed;
        }
        serializeJson(doc, body);
    }

    const nodecfg::NetCfg& net = s_postNet ? *s_postNet : s_cfg.net;
    WiFiClient  client;
    HTTPClient  http;
    char url[96];
    snprintf(url, sizeof(url), "http://%s:%u/api/ingest",
             net.host, (unsigned)net.port);

    s_linkStatus.attempted = true;
    if (!http.begin(client, url)) {
        LOGLN("[post] http.begin failed");
        s_linkStatus.lastOk = false;
        return PostResult::Failed;
    }
    http.setTimeout(5000);
    http.addHeader("Content-Type", "application/json");
    http.addHeader("X-Ingest-Token", net.token);
    if (net.basic_user[0] != '\0') {
        http.setAuthorization(net.basic_user, net.basic_pass);
    }

    const int code = http.POST(body);
    body = String();   // the request is gone; give its ~3.8 KB back before the reply
    const String reply = (code > 0) ? http.getString() : String();
    http.end();

    if (code != 200) {
        // No answer, or one that is not this endpoint's. Keep everything: this
        // is the case the queue exists for.
        if (code > 0) LOGF("[post] %d (%d held)\n", code, s_backlog.count());
        else LOGF("[post] %s (%d held)\n",
                           http.errorToString(code).c_str(), s_backlog.count());
        s_linkStatus.lastOk = false;
        const uint8_t a = s_link.postResult(false);
        // Not while a restart is pending: discovery rewrites s_cfg's host,
        // which is the collector's new config now, not the one posting.
        if ((a & NodeSync::LA_DISCOVER) && !s_restartPending) runDiscovery();
        return PostResult::Failed;
    }

    s_linkStatus.lastOk   = true;
    s_linkStatus.everOk   = true;
    s_linkStatus.lastOkMs = millis();
    if (s_link.postResult(true) & NodeSync::LA_TRIAL_OK) {
        LOGLN("[cfg] the new network settings reached the collector; kept");
        s_sync.trialRev = 0;
        syncSave(s_sync);
    }
    // Delivered with this POST: the report and the refusal.
    if (withCfg) s_reportedSinceBoot = true;
    if (errRev && s_sync.err.rev == errRev) {
        s_sync.err.clear();
        syncSave(s_sync);
    }
    s_fwReport.delivered(fwTok);

    // ── What the collector says it did, and what this node does about it ────
    //
    // `accepted` is the length of the PREFIX of the batch the collector
    // consumed. It is not the same as "how many it liked": a reading it threw
    // out as unusable is still consumed, because re-sending it would fail the
    // same way for ever. What is NOT consumed is whatever it had no room for —
    // its history queue is 64 readings and this node offers 192 — and those
    // are still here, in order, to offer again when it has drained some.
    //
    // A collector that predates this field answers without it. Defaulting to
    // `n` is what makes that upgrade path work: an older collector took the
    // batch through the live mailbox and re-sending would only overwrite it,
    // so the whole batch counts as delivered.
    //
    // THE REPLY CAN CARRY A WHOLE CONFIG (§3), secrets included — up to ~2 KB
    // of JSON. ArduinoJson 7's document grows as it parses, so there is no
    // fixed buffer to outgrow; what bounds it is the heap, and the request
    // body has already been released above to make room.
    int accepted = n;
    int room     = -1;
    {
        JsonDocument res;
        if (deserializeJson(res, reply) == DeserializationError::Ok) {
            accepted = res["accepted"] | n;
            room     = res["room"]     | -1;
            handleReplyCfg(res["cfg"]);
            readReplyFw(res["fw"]);
        } else {
            // 200 with a body this node cannot read: something in the way
            // answering for the collector, or an out-of-memory parse. The
            // status line is all there is to go on, and a node that never
            // empties its queue stops being able to record anything new.
            LOGF("[post] %d readings -> 200, unreadable reply\n", n);
            s_fwOffer.present = false;
        }
    }

    if (n == 0) return PostResult::Delivered;   // a report with nothing queued

    if (accepted < 0) accepted = 0;
    if (accepted > n) accepted = n;

    if (accepted == 0) {
        // Up, reachable, and taking nothing: its queue is full and needs a
        // sensor tick or two to drain. Everything stays here.
        //
        // THERE IS NO ATTEMPT LIMIT AND NO GIVING UP, deliberately. If the
        // collector never drains — no remote sensor configured for this node,
        // say — the ring shedding its own oldest entry is already the right
        // answer, and it goes on recording throughout. A node that threw a
        // batch away to unstick itself would be discarding readings to solve a
        // problem at the other end.
        LOGF("[post] collector took 0 of %d (room %d, %d held)\n",
                      n, room, s_backlog.count());
        return PostResult::Held;
    }

