n3tk0/ESP32_Logger/node/src/main.cpp
    s_backlog.drop(accepted);

    if (accepted < n) {
        LOGF("[post] %d of %d taken (room %d, %d held)\n",
                      accepted, n, room, s_backlog.count());
        return PostResult::Held;    // it is full; the next batch would only be refused
    }

    LOGF("[post] %d readings taken (%d still held)\n",
                  accepted, s_backlog.count());
    return PostResult::Delivered;
}

/// Read the sensors and remember what they said. NEEDS NO NETWORK, and that
/// is the point: the cycle where the link is down is the cycle whose readings
/// the queue exists to keep.
static void collectReading() {
    NodeReading vals[NODE_MAX_READINGS];
    const int n = nodeSensorsRead(s_cfg, vals, NODE_MAX_READINGS);
    if (n == 0) {
        LOGLN("[sensor] nothing to record this cycle");
        return;
    }
    const uint32_t ms = millis();
    for (int i = 0; i < n; i++) {
        const char* name = s_names.intern(vals[i].name);
        if (!name) {
            LOGF("[sensor] no room to name \"%s\"; dropped\n", vals[i].name);
            continue;
        }
        s_backlog.push(NodeBacklog::Entry{ms, vals[i].value, name, vals[i].unit});
    }
}

/// Hand over as much of the backlog as the collector will take. Returns true
/// when any POST this cycle was answered — the collector is there.
///
/// THE NEW READING GOES THROUGH THE SAME QUEUE as everything else rather than
/// down a separate live path. One route means one set of rules: it is sent
/// with an age of zero when the link is up, and it is still there — with an
/// honest age — when the link was down.
static bool flushBacklog(int maxBatches) {
    // Nothing queued still gets one POST: the config exchange rides on it.
    if (s_backlog.count() == 0) return postBatch() != PostResult::Failed;

    // Several batches, so a node coming back from an outage catches up faster
    // than it accumulates — but a bounded number, so a reconnection is not a
    // burst the collector's rate limiter reads as a flood. Stops at the first
    // batch that does not leave the queue: whatever refused one will refuse
    // the next, and the point is to wait, not to hammer.
    bool answered = false;
    for (int b = 0; b < maxBatches && s_backlog.count() > 0; b++) {
        const PostResult r = postBatch();
        if (r != PostResult::Failed) answered = true;
        if (r != PostResult::Delivered) break;
        yield();
    }
    return answered;
}

/// §4.7: the network settings the collector sent reached nothing for five
/// cycles. Put the previous config back, tell the collector why on the first
/// POST that gets through, and restart on the old settings.
static void rollBack() {
    const uint16_t rev = s_sync.trialRev;
    s_sync.trialRev = 0;
    if (!storeRollback()) {
        LOGLN("[cfg] no collector on the new settings, and no backup to "
                       "return to; keeping them");
        syncSave(s_sync);
        return;
    }
    s_sync.err.set(rev, NodeSync::ROLLBACK_FIELD, NodeSync::ROLLBACK_REASON);
    syncSave(s_sync);
    LOGF("[cfg] rev %u rolled back: no collector on the new settings; restarting\n",
                  (unsigned)rev);
    delay(200);
    ESP.restart();
}

/// The backlog is RAM and does not survive a restart, so hand over what the
/// collector will take first — it has just answered, so it is there.
/// Bounded: a collector with a full queue takes nothing, and neither a new
/// config nor a new firmware is worth waiting indefinitely for.
static void flushBeforeRestart() {
    if (s_backlog.count() > 0) flushBacklog(8);
    if (s_backlog.count() > 0)
        LOGF("[node] restarting with %d readings not delivered\n", s_backlog.count());
}

static void restartForConfig() {
    flushBeforeRestart();
    LOGLN("[cfg] restarting to apply the collector's config");
    delay(200);
    ESP.restart();
}

// ---------------------------------------------------------------------------
// Firmware from the collector (docs/NODE_OTA.md §3)
// ---------------------------------------------------------------------------

/// The whole download, start to verdict. A 470 KB image on a LAN takes 10-20
/// s; three minutes is a link that is barely there, and past that the node
/// has been deaf (no sensor reads, no page) for long enough.
static const uint32_t FW_DOWNLOAD_MAX_MS = 180000;
/// No byte for this long is a collector that has gone, not a slow one.
static const uint32_t FW_STALL_MS        = 15000;
/// Update.begin() takes a 4 KB sector buffer, the TCP connection a few KB
/// more, the chunk below 1 KB. Starting with less than this is starting
/// something that ends in an out-of-memory reset halfway through erasing.
static const uint32_t FW_MIN_HEAP        = 16384;
static const size_t   FW_CHUNK           = 1024;

/// GET the offered image and stream it through FwFlash. True = staged; false
/// with `reason` set to the fw_error reason. The running sketch is untouched
/// on every false path (FwFlash's destructor aborts).
static bool downloadFw(const NodeFw::Offer& o, char* reason, size_t cap) {
    const uint32_t heap = ESP.getFreeHeap();
    if (heap < FW_MIN_HEAP) {
        LOGF("[fw] %u bytes of heap; not starting a download\n", (unsigned)heap);
        nodecfg::copyStr(reason, cap, "no_memory");
        return false;
    }
    // Where this cycle's POSTs went (see s_postNet), with the same token and
    // basic auth as postBatch(): the collector serves the image behind them.
    const nodecfg::NetCfg& net = s_postNet ? *s_postNet : s_cfg.net;
    char url[24 + nodecfg::HOST_CAP + NodeFw::PATH_CAP];
    snprintf(url, sizeof(url), "http://%s:%u%s", net.host, (unsigned)net.port, o.path);

    WiFiClient client;
    HTTPClient http;
    if (!http.begin(client, url)) {
        nodecfg::copyStr(reason, cap, "download_failed");
        return false;
    }
    http.setTimeout(10000);
    http.addHeader("X-Ingest-Token", net.token);
    if (net.basic_user[0] != '\0') http.setAuthorization(net.basic_user, net.basic_pass);

    const int code = http.GET();
    if (code != 200) {
        LOGF("[fw] GET %s -> %d\n", o.path, code);
        snprintf(reason, cap, "http_%d", code);
        http.end();
        return false;
    }
    // -1 = no Content-Length (chunked): the offer's size is then the only
    // one there is, and Update.end() refuses a body that stops short of it.
    const int len = http.getSize();
    if (len >= 0 && (uint32_t)len != o.size) {
        LOGF("[fw] the collector sends %d bytes, the offer said %u\n", len, (unsigned)o.size);
        nodecfg::copyStr(reason, cap, "size_mismatch");
        http.end();
        return false;
    }

    FwFlash fl;
    uint8_t* buf = new (std::nothrow) uint8_t[FW_CHUNK];
    if (!buf || !fl.begin(o.size, o.md5)) {
        nodecfg::copyStr(reason, cap, buf ? fl.error() : "no_memory");
        if (fl.detail()[0]) LOGF("[fw] %s\n", fl.detail());
        delete[] buf;
        http.end();
        return false;
    }
    LOGF("[fw] downloading \"%s\" (%u bytes, attempt %u)\n", o.ver, (unsigned)o.size,
         (unsigned)o.attempt);

    WiFiClient* in = http.getStreamPtr();
    const uint32_t t0 = millis();
    uint32_t lastByte = t0, got = 0, nextLog = 65536;
    const char* err = nullptr;
    while (got < o.size) {
        if (millis() - t0 > FW_DOWNLOAD_MAX_MS) { err = "timeout"; break; }
        const size_t avail = in ? (size_t)in->available() : 0;
        if (avail == 0) {
            if (!in || !in->connected()) { err = "download_failed"; break; }
            if (millis() - lastByte > FW_STALL_MS) { err = "timeout"; break; }
            // Feeds the watchdog and lets the WiFi stack bring the next
            // segment in; a bare spin here is a WDT reset.
            delay(1);
            continue;
        }
        size_t want = avail < FW_CHUNK ? avail : FW_CHUNK;
        if (want > o.size - got) want = o.size - got;
        const int n = in->read(buf, want);
        if (n <= 0) { yield(); continue; }
        if (!fl.write(buf, (size_t)n)) { err = fl.error(); break; }
        got += (uint32_t)n;
        lastByte = millis();
        if (got >= nextLog) {
            LOGF("[fw] %u%%\n", (unsigned)((uint64_t)got * 100 / o.size));
            nextLog += 65536;
        }
        // Update.write() yields while it erases and writes a sector; the
        // chunks in between must too.
        yield();
    }
    delete[] buf;
    http.end();

    if (!err && !fl.finish()) err = fl.error();
    if (err) {
        LOGF("[fw] failed after %u of %u bytes: %s %s\n", (unsigned)got, (unsigned)o.size,
             err, fl.detail());
        nodecfg::copyStr(reason, cap, err);
        return false;
    }
    return true;
}

