n3tk0/ESP32_Logger/node/src/main.cpp
/// Act on the offer the cycle's replies carried, if any (§3 steps 1-5).
static void runFwOffer() {
    const NodeFw::Offer o = s_fwOffer;
    s_fwOffer.present = false;
    const uint32_t room = FwFlash::maxImage();
    switch (NodeFw::decideOffer(o, s_fwMd5, s_fwReport, room)) {
        case NodeFw::OfferAction::None:
        case NodeFw::OfferAction::AlreadyFailed:
            return;
        case NodeFw::OfferAction::Running:
            // The collector marks the target done from this POST's fw_md5;
            // an offer of the running image is one it made before it knew.
            return;
        case NodeFw::OfferAction::Invalid: {
            const char* why = NodeFw::invalidReason(o, room);
            LOGF("[fw] cannot take the offered image: %s\n", why);
            s_fwReport.fail(o.md5, o.attempt, why);
            return;
        }
        case NodeFw::OfferAction::Download:
            break;
    }
    char reason[NodeFw::REASON_CAP];
    if (!downloadFw(o, reason, sizeof(reason))) {
        s_fwReport.fail(o.md5, o.attempt, reason);
        return;
    }
    // §3 step 4. Staged: the eboot command is written, and the next boot
    // copies the image over this sketch. The new firmware's first POST
    // carries its fw_md5, which is what makes the target done.
    flushBeforeRestart();
    LOGLN("[fw] restarting into the new firmware");
    delay(200);
    ESP.restart();
}

// ---------------------------------------------------------------------------
void setup() {
    Serial.begin(115200);
    delay(200);
    LOGLN("\n\nESP32_Logger sensor node " NODE_FW_VERSION);
    // The marker, printed: this reference is what keeps it in the image.
    Serial.println(FPSTR(FW_MARKER));
    nodecfg::copyStr(s_fwMd5, sizeof(s_fwMd5), ESP.getSketchMD5().c_str());
    LOGF("sketch md5 %s\n", s_fwMd5[0] ? s_fwMd5 : "(unreadable)");

    // Read the button before anything else claims GPIO0.
    const bool forcePortal = portalButtonHeld();

    storeLoad(s_cfg);
    syncLoad(s_sync);
    if (s_sync.trialRev && s_sync.trialRev != s_cfg.rev) {
        // Written just before a config save that never happened (a reset
        // between the two): the config on flash is not the one on trial.
        LOGF("[cfg] dropping the trial of rev %u: the saved config is rev %u\n",
                      (unsigned)s_sync.trialRev, (unsigned)s_cfg.rev);
        s_sync.trialRev = 0;
        syncSave(s_sync);
    }
    if (s_sync.trialRev) {
        LOGF("[cfg] rev %u's network settings are on trial\n",
                      (unsigned)s_sync.trialRev);
        s_link.beginTrial();
    }
    // A refusal (or rollback) not yet reported is also one not to take again
    // if the collector offers it before it has heard.
    if (s_sync.err.pending()) s_rejectedRev = s_sync.err.rev;
    portalSetLinkStatus(&s_linkStatus);

    {
        // Said at boot, not enforced: a config migrated from the old format
        // runs even if today's rules would refuse it (a node name with a dot
        // in it, say), because refusing would orphan its history on the
        // collector. The page shows the same complaint when it is saved.
        nodecfg::Validation* v = new (std::nothrow) nodecfg::Validation();
        if (v) {
            nodeValidate(s_cfg, *v);
            if (!v->ok) LOGF("[cfg] warning: %s: %s\n", v->error.field, v->error.reason);
            delete v;
        }
    }

    // Two reasons to run the portal with no timeout: there is nothing to fall
    // back to, or the user explicitly asked by holding FLASH through reset.
    // Both mean "wait for a human", so waiting indefinitely is correct.
    if (forcePortal || !storeIsComplete(s_cfg)) {
        if (forcePortal) LOGLN("[portal] FLASH held at boot");
        else             LOGLN("[portal] no usable config");
        if (portalRun(s_cfg, 0)) {
            delay(200);
            ESP.restart();
        }
    }

    LOGF("node \"%s\" -> %s:%u every %u s (rev %u%s)\n",
                  s_cfg.name, s_cfg.net.host, (unsigned)s_cfg.net.port,
                  (unsigned)s_cfg.interval_s, (unsigned)s_cfg.rev,
                  s_cfg.local ? ", local" : "");

    s_sensorsOk = nodeSensorsBegin(s_cfg);
    LOGF("sensors: %s\n", nodeSensorsDescribe());
    ensureWifi();
}

void loop() {
    if (s_portalBgRunning) {
        portalHandleClient();
    }

    const uint32_t now = millis();

    // Unsigned subtraction, so the ~49-day millis() wrap is a non-event.
    if (s_postedOnce && (now - s_lastPost) < (uint32_t)s_cfg.interval_s * 1000UL) {
        delay(50);
        return;
    }
    s_lastPost   = now;
    s_postedOnce = true;

    // THE SENSOR PROBE FIRST, THEN THE NETWORK, AND NEITHER GATES THE OTHER.
    //
    // Both orderings have been wrong here. With the WiFi check first, a node
    // that cannot reach its router never re-probes its sensor — ensureWifi()
    // spends three connect timeouts and can block in the portal, then returns
    // false, every cycle forever, and a power cut that took out both the
    // router and a cold breakout leaves the sensor unfound until someone
    // walks to it. With the sensor check first (as it once shipped), a node
    // whose sensor was missing returned before ever reaching ensureWifi(), so
    // it never reconnected after a router reboot — and the background page,
    // the one way to fix the wiring without a cable, is started from in there.
    //
    // The probe needs no network and costs a few milliseconds, so it goes
    // first and unconditionally; the network follows and is likewise not
    // conditional on the sensor.
    //
    // With every entry down it runs each cycle. With only some down (a DS18B20
    // plugged in after boot beside a working BME280) it runs every
    // SENSOR_RETRY_CYCLES: nodeSensorsBegin() skips the entries that already
    // answered, so a retry costs only the missing ones' probes.
    if (!nodeSensorsReady() ||
        (s_sensorsOk < (int)s_cfg.sensor_count && ++s_sensorCycles >= SENSOR_RETRY_CYCLES)) {
        s_sensorCycles = 0;
        const int was = s_sensorsOk;
        s_sensorsOk = nodeSensorsBegin(s_cfg);
        if (s_sensorsOk != was) LOGF("sensors: %s\n", nodeSensorsDescribe());
    }

    // MEASURED AND REMEMBERED BEFORE THE NETWORK IS EVEN LOOKED AT. The one
    // thing the backlog exists for — the cycle where the router is down — must
    // not be the one cycle whose reading was never taken.
    if (nodeSensorsReady()) collectReading();

    // An offer is only ever the one this cycle's replies carried.
    s_fwOffer.present = false;
    if (ensureWifi()) flushBacklog(NODE_BATCHES_PER_CYCLE);

    if (s_link.cycleEnd() & NodeSync::LA_ROLLBACK) rollBack();
    if (s_restartPending) restartForConfig();
    // After the POSTs (§3), and never with a config restart pending: that
    // restart comes first, and the collector offers the image again to the
    // node that comes back (the target is still `sending`).
    if (s_fwOffer.present) runFwOffer();
}
